app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `id` = 2
 LIMIT 1
---
    private function buscaUsuarioOu404(int $id = null)
    {
        if (!$id || !$usuario = $this->usuarioModel->where('id', $id)->first()) {