app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
---
    public function index()
    {
        $usuarios = $this->usuarioModel->withDeleted(true)->findAll();

DELETE FROM `usuarios`
WHERE `id` IN ('1')
---
    public function excluir($id = null)
    {
        $usuario = $this->buscaUsuarioOu404($id);


        if ($usuario->is_admin) {
            return redirect()->back()->with('informacao', "Ops! Não é permitido excluir um usuário do tipo <b>administrador</b>.");
        }

        if ($this->request->getMethod() === 'post') {
            $this->usuarioModel->delete($id);

SELECT *
FROM `usuarios`
WHERE `id` = 2
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1
---
    private function buscaUsuarioOu404(int $id = null)
    {
        if (!$id || !$usuario = $this->usuarioModel->where('id', $id)->withDeleted(true)->first()) {